## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 6 to add, 6 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_appstore_metrics:1" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "masked-metrics-snfsv-staging"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "MASK_DATA"
                          + value = "True"
                        },
                    ]
                  + essential        = true
                  + image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/masked_appstore_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-masked-appstore-metrics"
                        }
                    }
                  + mountPoints      = []
                  + name             = "masked_appstore_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + name                  = "log_router"
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "ca-central-1"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                  + privileged       = true
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "masked_appstore_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_metrics_event_rule-terraform-20210617204945093200000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:28" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "masked-metrics-snfsv-staging"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "MASK_DATA"
                          + value = "True"
                        },
                    ]
                  + essential        = true
                  + image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/masked_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-masked-metrics"
                        }
                    }
                  + mountPoints      = []
                  + name             = "masked_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + name                  = "log_router"
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "ca-central-1"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                  + privileged       = true
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "masked_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210702182404782300000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:15" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "masked-metrics-snfsv-staging"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "MASK_DATA"
                          + value = "True"
                        },
                      + {
                          + name  = "SERVER_EVENTS_ENDPOINT"
                          + value = "https://retrieval.wild-samphire.cdssandbox.xyz/events"
                        },
                    ]
                  + essential        = true
                  + image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/masked_server_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-masked-server-metrics"
                        }
                    }
                  + mountPoints      = []
                  + name             = "masked_server_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "metrics_token"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + name                  = "log_router"
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "ca-central-1"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                  + privileged       = true
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/server_metrics_container_execution_role"
      + family                   = "masked_server_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_appstore_metrics_event_rule-terraform-20210702182404731800000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_appstore_metrics:1" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "unmasked-metrics-snfsv-staging"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "MASK_DATA"
                          + value = "False"
                        },
                    ]
                  + essential        = true
                  + image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/unmasked_appstore_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-unmasked-appstore-metrics"
                        }
                    }
                  + mountPoints      = []
                  + name             = "unmasked_appstore_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + name                  = "log_router"
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "ca-central-1"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                  + privileged       = true
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "unmasked_appstore_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_metrics_event_rule-terraform-20210617204945092200000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:26" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "unmasked-metrics-snfsv-staging"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "MASK_DATA"
                          + value = "False"
                        },
                    ]
                  + essential        = true
                  + image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/unmasked_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-unmasked-metrics"
                        }
                    }
                  + mountPoints      = []
                  + name             = "unmasked_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + name                  = "log_router"
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "ca-central-1"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                  + privileged       = true
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "unmasked_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210702182404726800000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:15" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "unmasked-metrics-snfsv-staging"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "MASK_DATA"
                          + value = "False"
                        },
                      + {
                          + name  = "SERVER_EVENTS_ENDPOINT"
                          + value = "https://retrieval.wild-samphire.cdssandbox.xyz/events"
                        },
                    ]
                  + essential        = true
                  + image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:latest"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/unmasked_server_metrics_ecs"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-unmasked-server-metrics"
                        }
                    }
                  + mountPoints      = []
                  + name             = "unmasked_server_metrics"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "metrics_token"
                          + valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + name                  = "log_router"
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "ca-central-1"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                  + privileged       = true
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/server_metrics_container_execution_role"
      + family                   = "unmasked_server_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

Plan: 6 to add, 6 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>